{
    "version": "https://jsonfeed.org/version/1",
    "title": "mridoni&#x27;s development blog",
    "description": "",
    "home_page_url": "https://mridoni.github.io",
    "feed_url": "https://mridoni.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Marco Ridoni"
    },
    "items": [
        {
            "id": "https://mridoni.github.io/gix-ide-110-is-available.html",
            "url": "https://mridoni.github.io/gix-ide-110-is-available.html",
            "title": "Gix-IDE 1.1.0 is available",
            "summary": "This is a release for Gix-IDE that integrates the new \"standalone\" debugger engine and consolidates the various development (internal) branches. While the \"standard\" debugger is still the one to be currently used, having a single and published version will help speed up the development process. This release also arrives with new binary packages: compiler and runtime files have been moved outside the installer itself and will be downloaded on-demand. While this means that an Internet&hellip;",
            "content_html": "<p>This is a release for Gix-IDE that integrates the new \"standalone\" debugger engine and consolidates the various development (internal) branches. While the \"standard\" debugger is still the one to be currently used, having a single and published version will help speed up the development process.</p>\n<p>This release also arrives with new binary packages: compiler and runtime files have been moved outside the installer itself and will be downloaded on-demand. While this means that an Internet connection is needed to install Gix-IDE with a compiler, it makes the installer a lot smaller and more easily upgradable. As a consequence, there are no more \"no-compilers\" packages, you just will just have to skip installing the compiler(s) when running the installer.</p>\n<p>Moreover, the Windows binary installers have been signed with my code-signing certificate, for an added level of trust.</p>\n<p>There is a brand-new package for Ubuntu 22.04, that should avoid the compatibility hacks that were needed for the previous package (aimed at 20.04). Debian-specific packages will follow as soon as possible.</p>\n<p>Since this is the first release of a new cycle (a so-called \".0\") there are probably a few bugs - both in packaging and in the code itself - that have to be shaken down, and a few known issues (see below), but as development is gaining some traction, I really needed to streamline the process, and this release is a step in that (hopefully right) direction.</p>\n<p>Another point of attention is the fact that the new packages are being built with GitHub Actions: the building and packaging process is entirely reproducible using the workflows supplied in this repository. This also means that - internally - development has been moved entirely from a SVN-based setup to Git/GitHub: some long-term work will still take place internally (at first), but updates on GitHub will be quicker and more frequent.</p>\n<p>All of the above (building, packaging, etc.), starting from the next release (v1.0.19), also apply to GixSQL, for which I am doing some planning/research and hope to have a more accurate timeframe really soon.</p>\n<p>By the way: I have added a new e-mail address to my key because I started to sign the binary installers with a code signing certificate, and it just seemed \"prettier\" to use for the e-mail contact a domain that I own instead of a generic GMail address.</p>\n<p>Binary packages available</p>\n<ul>\n<li>Windows x86</li>\n<li>Windows x64</li>\n<li>Linux x64 (Ubuntu 20.04LTS)</li>\n<li>Linux x64 (Ubuntu 22.04LTS)</li>\n</ul>\n<p>A summary of new features and fixes:</p>\n<ul>\n<li>Integrated \"standalone\" debugger (still not completely functional)</li>\n<li>Enabled rectangular selection in the editor</li>\n<li>Added tooltips for COBOL variables in the editor with variable information (the content of a variable is also displayed when debugging)</li>\n<li>ESQL blocks are now automatically skipped when debugging (the debugger stops on the first line of the block, then \"jumps\" after the END-EXEC clause when stepping</li>\n<li>Added new icons (including for file types used by Gix-IDE)</li>\n<li>Linux build and debugger fixes</li>\n</ul>\n<p>Known bugs and issues</p>\n<ul>\n<li>The standalone debugger is present but it is still a work in progress, so some things might not work as expected (e.g. debugging when using a MinGW-based compiler on Windows). The debugger version can be selected under Settings -&gt; Debug</li>\n<li>When debugging on Windows, a \"stray\" console window appear, this is probably from some logging artifact</li>\n</ul>\n<p>Available, as usual, on the <a href=\"https://github.com/mridoni/gix/releases/tag/v1.1.0\" target=\"_blank\" rel=\"noopener noreferrer\">Release page</a> on GitHub.</p>\n<p><a href=\"https://paypal.me/mridoni\" target=\"_blank\" rel=\"noopener noreferrer\">Donations </a>or <a href=\"https://github.com/sponsors/mridoni\" target=\"_blank\" rel=\"noopener noreferrer\">sponsors</a> are welcome.</p>",
            "author": {
                "name": "Marco Ridoni"
            },
            "tags": [
            ],
            "date_published": "2022-12-07T17:27:13+01:00",
            "date_modified": "2022-12-07T17:27:13+01:00"
        },
        {
            "id": "https://mridoni.github.io/gixsql-1019-is-out.html",
            "url": "https://mridoni.github.io/gixsql-1019-is-out.html",
            "title": "GixSQL 1.0.19 is out",
            "summary": "This is a new release for GixSQL, that mainly re-implements autocommit and updatable cursor support, and fixes a few bugs. For information on how these two features work, look at the (updated) documentation, where a specific section has been added. A point of attention is the fact that the new packages are being built with GitHub Actions: the building and packaging process is entirely reproducible using the workflows supplied in the repository. This also means&hellip;",
            "content_html": "<p>This is a new release for GixSQL, that mainly re-implements autocommit and updatable cursor support, and fixes a few bugs. For information on how these two features work, look at the (updated) documentation, where a specific section has been added.</p>\n<p>A point of attention is the fact that the new packages are being built with GitHub Actions: the building and packaging process is entirely reproducible using the workflows supplied in the repository. This also means that - internally - development has been moved entirely from a SVN-based setup to Git/GitHub: some long-term work will still take place internally (at first), but updates on GitHub will be quicker and more frequent.</p>\n<p><em>Note: I have added a new e-mail address to my key because I started to sign the binary installers with a code signing certificate, and it just seemed \"prettier\" to use for the e-mail contact a domain that I own instead of a generic GMail address.</em></p>\n<p>Binary packages available</p>\n<ul>\n<li>Windows x64 (MSVC + MinGW)</li>\n<li>Windows x64 (MinGW only)</li>\n<li>Windows x86 (MSVC + MinGW)</li>\n<li>Windows x86 (MinGW only)</li>\n<li>Windows x86 \"portable\"</li>\n<li>Linux x64 (Ubuntu 20.04)</li>\n</ul>\n<p>There is also a autoconf-enabled source package, to make building on Linux and MinGW easier.</p>\n<p>A summary of new features and fixes:</p>\n<ul>\n<li>Re-implemented autocommit and updatable cursor support (also affects <a class=\"issue-link js-issue-link\" data-error-text=\"Failed to load title\" data-id=\"1205386006\" data-permission-text=\"Title is private\" data-url=\"https://github.com/mridoni/gixsql/issues/14\" data-hovercard-type=\"issue\" data-hovercard-url=\"/mridoni/gixsql/issues/14/hovercard\" href=\"https://github.com/mridoni/gixsql/issues/14\">#14</a>)</li>\n<li>Docs and examples are now included in the autoconf tarball (fixes <a class=\"issue-link js-issue-link\" data-error-text=\"Failed to load title\" data-id=\"1244202721\" data-permission-text=\"Title is private\" data-url=\"https://github.com/mridoni/gixsql/issues/50\" data-hovercard-type=\"issue\" data-hovercard-url=\"/mridoni/gixsql/issues/50/hovercard\" href=\"https://github.com/mridoni/gixsql/issues/50\">#50</a>)</li>\n<li>Changed cursor state ownership (fixes <a class=\"issue-link js-issue-link\" data-error-text=\"Failed to load title\" data-id=\"1350462043\" data-permission-text=\"Title is private\" data-url=\"https://github.com/mridoni/gixsql/issues/115\" data-hovercard-type=\"issue\" data-hovercard-url=\"/mridoni/gixsql/issues/115/hovercard\" href=\"https://github.com/mridoni/gixsql/issues/115\">#115</a>)</li>\n<li>Fix for \"parser error on semicolon and error continuation does not work\" (<a class=\"issue-link js-issue-link\" data-error-text=\"Failed to load title\" data-id=\"1354513480\" data-permission-text=\"Title is private\" data-url=\"https://github.com/mridoni/gixsql/issues/118\" data-hovercard-type=\"issue\" data-hovercard-url=\"/mridoni/gixsql/issues/118/hovercard\" href=\"https://github.com/mridoni/gixsql/issues/118\">#118</a>)</li>\n</ul>\n<p>Availaible, as usual, on the <a href=\"https://github.com/mridoni/gixsql/releases/tag/v1.0.19\" target=\"_blank\" rel=\"noopener noreferrer\">Release page</a> on GitHub.</p>\n<p><a href=\"https://paypal.me/mridoni\" target=\"_blank\" rel=\"noopener noreferrer\">Donations </a>or <a href=\"https://github.com/sponsors/mridoni\" target=\"_blank\" rel=\"noopener noreferrer\">sponsors</a> are welcome.</p>",
            "author": {
                "name": "Marco Ridoni"
            },
            "tags": [
            ],
            "date_published": "2022-12-07T17:23:07+01:00",
            "date_modified": "2022-12-07T17:27:27+01:00"
        },
        {
            "id": "https://mridoni.github.io/gixsql-news-about-v1019.html",
            "url": "https://mridoni.github.io/gixsql-news-about-v1019.html",
            "title": "GixSQL: news about v1.0.19",
            "summary": "The internal branch v1.0.19dev has been merged into main and it will be the base for the upcoming version v1.0.19. It implements, as announced, support for autocommit and updatable cursors. It includes, obviously, some fixes that have been applied to the main branch in past few weeks. This merge will also allow to integrate fixes for other issues more easily. The final release of v1.0.19 should be out in a week, two at most, then&hellip;",
            "content_html": "<p>The internal branch v1.0.19dev has been merged into main and it will be the base for the upcoming version v1.0.19. It implements, as <a href=\"https://mridoni.github.io/gixsql-mid-november-update.html\" target=\"_blank\" rel=\"noopener noreferrer\">announced</a>, support for autocommit and updatable cursors. It includes, obviously, some fixes that have been applied to the main branch in past few weeks.</p>\n<p>This merge will also allow to integrate fixes for other issues more easily. The final release of v1.0.19 should be out in a week, two at most, then - barring the need for hotfixes - work will resume on Gix-IDE with two main targets: complete functionality for the standalone debugger and an enhanced error/output window.</p>",
            "author": {
                "name": "Marco Ridoni"
            },
            "tags": [
            ],
            "date_published": "2022-11-18T12:25:04+01:00",
            "date_modified": "2022-11-18T12:25:04+01:00"
        },
        {
            "id": "https://mridoni.github.io/gixsql-mid-november-update.html",
            "url": "https://mridoni.github.io/gixsql-mid-november-update.html",
            "title": "GixSQL: Mid-November update",
            "summary": "GixSQL is undergoing some work to re-implement two features: autocommit support and updatable cursors. Both of them have been there since the first releases, but due to several reasons (essentially lack of usage and bad assumptions) they were left behind and their functionality, in their current incarnation, is dubious. The new implementation sees these two features being moved mainly from the main library (libgixsql) to the database driver libraries (e.g. libgixsql-pgsql), with only a few&hellip;",
            "content_html": "<p>GixSQL is undergoing some work to re-implement two features: autocommit support and updatable cursors. Both of them have been there since the first releases, but due to several reasons (essentially lack of usage and bad assumptions) they were left behind and their functionality, in their current incarnation, is dubious.</p>\n<p>The new implementation sees these two features being moved mainly from the main library (libgixsql) to the database driver libraries (e.g. libgixsql-pgsql), with only a few parameters passed around. The rationale behind this move is that different DBMSs behave in different ways, and trying to keep a unified approach would only lead to confusion (and bugs, a lot of bugs). What follows is the level of support planned for the various DB drivers.</p>\n<h4>Autocommit</h4>\n<p>Autocommit will basically work in three different modes:</p>\n<ul>\n<li>Native: the connection will start in the default mode used by the database</li>\n<li>On: a <code>COMMIT </code>will be executed after each successful statement</li>\n<li>Off: the connection will start by opening a transaction. A new connection will be started after each <code>COMMIT </code>and <code>ROLLBACK</code></li>\n</ul>\n<p>Driver notes:</p>\n<ul>\n<li>MySQL and ODBC (through its own drivers) directly support autocommit to be turned on or off, so the handling of this feature will be passed entirely to the native driver (e.g. libmysqlclient)</li>\n<li>Oracle has no concept of autocommit, just as PostgreSQL, but the first one always work in transaction mode, while transactions must be explicitly started in PostgreSQL. While autocommit (or \"transaction mode\" in the case of PostgreSQL) have been - and will further be - tested, these differences (and the ones above) can probably lead to different behaviours when switching a single codebase that makes heavy use of the autocommit feature to a different DB, if precautions are not taken and tests performed.</li>\n</ul>\n<h4>Updatable cursors</h4>\n<p>Updatable cursors will allow the update/deletion of a single cursor row after a fetch, using the clause <code>UPDATE...WHERE CURRENT OF mycursor </code>after a cursor has been opened <code>FOR UPDATE</code>.</p>\n<p>Driver notes:</p>\n<ul>\n<li>Oracle directly supports updatable cursors, so the handling of this feature will be passed entirely to the native driver.</li>\n<li>PostgreSQL directly supports updatable cursors when native cursors are enabled - this is the default - in the GixSQL driver (libgixsql-pgsql); in this case the handling of this feature will be passed entirely to the native driver. If cursors are emulated in PostgreSQL, updatable cursors are not available.</li>\n<li>MySQL and SQLite have updatable cursor emulation: the table on which the cursor is opened must have a unique key that will be used for the update. This has been proven to work, but it is obviously (a lot) slower than native support.</li>\n<li>ODBC will defer updatable cursor handling to its own drivers: it depends on them whether updatable cursors will be available or not. As a side note the ODBC driver for MySQL (MySQL Connector/ODBC) uses the same technique illustrated above to emulate updatable cursors.</li>\n</ul>\n<p>While this is the focus of what will be v1.0.19 (some prereleases will surely be published before that) there will be the usual amount of bug fixes and, where possible, smaller features.</p>",
            "author": {
                "name": "Marco Ridoni"
            },
            "tags": [
            ],
            "date_published": "2022-11-16T18:14:40+01:00",
            "date_modified": "2022-11-16T19:23:23+01:00"
        },
        {
            "id": "https://mridoni.github.io/gix-ide-v110dev1-pre-release-is-out.html",
            "url": "https://mridoni.github.io/gix-ide-v110dev1-pre-release-is-out.html",
            "title": "Gix-IDE v1.1.0dev1 (pre-release) is out",
            "summary": "This is a pre-release for Gix-IDE that integrates the new \"standalone\" debugger engine and consolidates the various development (internal) branches. While the \"standard\" debugger is the one to be currently used, having a single and published version will help speed up the development process. This pre-release also arrives with new binary packages: compiler and runtime files have been moved outside the installer itself and will be downloaded on-demand. While this means that an Internet connection is&hellip;",
            "content_html": "<p>This is a pre-release for Gix-IDE that integrates the new \"standalone\" debugger engine and consolidates the various development (internal) branches. While the \"standard\" debugger <strong>is</strong> the one to be currently used, having a single and published version will help speed up the development process.</p>\n<p>This pre-release also arrives with new binary packages: compiler and runtime files have been moved outside the installer itself and will be downloaded on-demand. While this means that an Internet connection is needed to install Gix-IDE <em>with</em> a compiler, it makes the installer a lot smaller and more easily upgradable. As a consequence, there are no more \"no-compilers\" packages, you just will just have to skip installing the compiler(s) when running the installer.</p>\n<p>Moreover, the Windows binary packages have been signed with my code-signing certificate, for an added level of trust.</p>\n<p>There is a brand-new package for Ubuntu 22.04, that should avoid the compatibility hacks that were needed for the previous package (aimed at 20.04). Debian-specific packages will follow as soon as possible.</p>\n<p>Beware: this pre-release is to be considered of \"beta quality\": there are probably a few bugs - both in packaging and in the code itself - that have to be shaken down, and a few known issues (see below), but as development is gaining some traction, I really needed to streamline the process, and this (pre-)release is a step in that direction.</p>\n<p>Another point of attention is the fact that the new packages are being built with GitHub Actions: the building and packaging process is entirely reproducible using the workflows supplied in this repository. This also means that - internally - development has been moved almost entirely from a SVN-based setup to Git/GitHub: some long-term work will still take place internally (at first), but updates on GitHub will be quicker and more frequent.</p>\n<p>All of the above (building, packaging, etc.), starting from the next release, will also apply to GixSQL, for which I am doing some planning/research and hope to have a timeframe really soon.</p>\n<p>The packages are signed with my GPG private key. The corresponding public key (<a href=\"mailto:m.ridoni@gmail.com\">m.ridoni@gmail.com</a>, fingerprint 70E4 08CF B89B 5FA8 32E4 5292 EFDC 94BD 5260 B939) has been published on pgp.mit.edu and keyserver.ubuntu.com and is available at <a href=\"https://github.com/mridoni.gpg\">https://github.com/mridoni.gpg</a></p>\n<p>Binary packages available</p>\n<ul>\n<li>Windows x86</li>\n<li>Windows x64</li>\n<li>Linux x64 (Ubuntu 20.04LTS)</li>\n<li>Linux x64 (Ubuntu 22.04LTS)</li>\n</ul>\n<p>A summary of new features and fixes:</p>\n<ul>\n<li>Integrated \"standalone\" debugger (still not completely functional)</li>\n<li>Enabled rectangular selection in the editor</li>\n<li>Added tooltips for COBOL variables in the editor with variable information (the content of a variable is also displayed when debugging)</li>\n<li>ESQL blocks are now automatically skipped when debugging (the debugger stops on the first line of the block, then \"jumps\" after the END-EXEC clause when stepping</li>\n<li>Added new icons (including for file types used by Gix-IDE)</li>\n<li>Linux build and debugger fixes</li>\n</ul>\n<p>Known bugs and issues</p>\n<ul>\n<li>The standalone debugger is present but still not functional. The next step, of course, will be enabling it. If you <em>really</em> want to try, the debugger version can be selected under Settings -&gt; Debug</li>\n<li>When debugging on Windows, a \"stray\" console window appear, this is probably from some logging artifact</li>\n</ul>\n<p>As usual, the release is <a href=\"https://github.com/mridoni/gix/releases/tag/v1.1.0dev1\" target=\"_blank\" rel=\"noopener noreferrer\">available on GitHub</a></p>",
            "author": {
                "name": "Marco Ridoni"
            },
            "tags": [
            ],
            "date_published": "2022-11-07T17:14:09+01:00",
            "date_modified": "2022-11-07T18:11:16+01:00"
        },
        {
            "id": "https://mridoni.github.io/new-debugger-source-available.html",
            "url": "https://mridoni.github.io/new-debugger-source-available.html",
            "title": "&quot;New debugger&quot; source available",
            "summary": "The new-debugger branch has been merged into main on GitHub. The corresponding binary packages will be available in a few days with a new pre-release (most likely as v1.1.0dev1). The packaging process is almost complete: the workflows included in the repository can already be used to build the binary packages, but there are still a few details I want to iron out before distributing the packages: this will still be a pre-release and it's a&hellip;",
            "content_html": "<p>The <em>new-debugger</em> branch has been merged into <em>main </em>on GitHub. The corresponding binary packages will be available in a few days with a new pre-release (most likely as v1.1.0dev1). </p>\n<p>The packaging process is almost complete: the workflows included in the repository can already be used to build the binary packages, but there are still a few details I want to iron out before distributing the packages: this will still be a pre-release and it's a milestone that will help me to streamline the development process, but obviously I would like it to push it out without major bugs or blocking issues.</p>\n<p>The Windows binary packages will also be signed, for the first time, with a code signing certificate. I really dislike the practices that seem rampant in the \"security industry\", with prices that seem to bear no relation to the actual product <span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">b</span><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">eing sold </span><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">(including the identity verification, not just the certificate). </span>Nevertheless, since Gix-IDE is not-so-easy to build and package for ordinary users, and the SmartScreen alert on Windows had some people justifiably worried, I decided to bite the bullet.</p>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Side note: I sincerely hope that someone at SigStore (and Microsoft) comes to the realization that software does not mean only containers and images but also old-fashioned software packages. To be clear: SigStore is great but, in my very own opinion, its lack of attention (so far) towards a great part of the computing world, apart from making it useless in many cases, is a disappointment.</span></p>",
            "author": {
                "name": "Marco Ridoni"
            },
            "tags": [
            ],
            "date_published": "2022-10-30T09:39:46+01:00",
            "date_modified": "2022-10-30T09:39:46+01:00"
        },
        {
            "id": "https://mridoni.github.io/gixsql-v1018b-is-out.html",
            "url": "https://mridoni.github.io/gixsql-v1018b-is-out.html",
            "title": "GixSQL v1.0.18b is out",
            "summary": "This is a \"hotfix\" release for GixSQL, that fixes a few issues. Available binary packages: There is also a autoconf-enabled source package, to make building on Linux and MinGW easier. A summary of new features and fixes: All the binary packages are available, as usual, on the corresponding Release page on GitHub.",
            "content_html": "<p>This is a \"hotfix\" release for GixSQL, that fixes a few issues. </p>\n<p>Available binary packages:</p>\n<ul>\n<li>Windows x64 (MSVC + MinGW)</li>\n<li>Windows x64 (MinGW only)</li>\n<li>Windows x86 (MSVC + MinGW)</li>\n<li>Windows x86 (MinGW only)</li>\n<li>Windows x86 \"portable\"</li>\n<li>Linux x64 (Ubuntu 20.04)</li>\n</ul>\n<p>There is also a autoconf-enabled source package, to make building on Linux and MinGW easier.</p>\n<p>A summary of new features and fixes:</p>\n<ul>\n<li>Changed cursor initialization (should fix <a class=\"issue-link js-issue-link\" data-error-text=\"Failed to load title\" data-id=\"1295941001\" data-permission-text=\"Title is private\" data-url=\"https://github.com/mridoni/gixsql/issues/88\" data-hovercard-type=\"issue\" data-hovercard-url=\"/mridoni/gixsql/issues/88/hovercard\" href=\"https://github.com/mridoni/gixsql/issues/88\">#88</a>)</li>\n<li>Fix for \"1.0.17/1.0.18 regression: COMMIT and ROLLBACK delete all cursor definitions -&gt; Status -111\" (<a class=\"issue-link js-issue-link\" data-error-text=\"Failed to load title\" data-id=\"1355475097\" data-permission-text=\"Title is private\" data-url=\"https://github.com/mridoni/gixsql/issues/119\" data-hovercard-type=\"issue\" data-hovercard-url=\"/mridoni/gixsql/issues/119/hovercard\" href=\"https://github.com/mridoni/gixsql/issues/119\">#119</a>)</li>\n<li>Merged pull request <a class=\"issue-link js-issue-link\" data-error-text=\"Failed to load title\" data-id=\"1402670500\" data-permission-text=\"Title is private\" data-url=\"https://github.com/mridoni/gixsql/issues/127\" data-hovercard-type=\"pull_request\" data-hovercard-url=\"/mridoni/gixsql/pull/127/hovercard\" href=\"https://github.com/mridoni/gixsql/pull/127\">#127</a> (thanks to Simon Sobisch)</li>\n</ul>\n<p>All the binary packages are available, as usual, on the corresponding <a href=\"https://github.com/mridoni/gixsql/releases/tag/v1.0.18b\" target=\"_blank\" rel=\"noopener noreferrer\">Release page on GitHub</a>.</p>",
            "author": {
                "name": "Marco Ridoni"
            },
            "tags": [
            ],
            "date_published": "2022-10-27T17:49:28+02:00",
            "date_modified": "2022-10-27T17:49:28+02:00"
        },
        {
            "id": "https://mridoni.github.io/october-progress-update.html",
            "url": "https://mridoni.github.io/october-progress-update.html",
            "title": "October progress update",
            "summary": "GixSQL v1.0.18b (still a pre-release - or ad interim if you prefer) is almost ready and should be out in a couple of days at most. As I am writing this, the packages are being built and, after some testing, will be published on GitHub. Then the work will start on v1.0.19. GixSQL v1.0.18b will include solutions for issues #119, #88 and PR #127 (thanks to Simon Sobisch for that). The new build/packaging process (based&hellip;",
            "content_html": "<p>GixSQL v1.0.18b (still a pre-release - or <em>ad interim</em> if you prefer) is almost ready and should be out in a couple of days at most. As I am writing this, the packages are being built and, after some testing, will be published on GitHub. Then the work will start on v1.0.19. GixSQL v1.0.18b will include solutions for issues <a href=\"https://github.com/mridoni/gixsql/issues/119\" target=\"_blank\" rel=\"noopener noreferrer\">#119</a>, <a href=\"https://github.com/mridoni/gixsql/issues/88\" target=\"_blank\" rel=\"noopener noreferrer\">#88</a> and PR <a href=\"https://github.com/mridoni/gixsql/issues/127\" target=\"_blank\" rel=\"noopener noreferrer\">#127</a> (thanks to Simon Sobisch for that).</p>\n<p>The new build/packaging process (based on GitHub Actions) is going well, and should be ready for a pre-release in a couple of weeks at most, maybe less. As some of you may have noticed, a new branch (named \"new-debugger\") has debuted on Gix-IDE's repository. When everything is ready:</p>\n<ul>\n<li>the \"new-debugger\" branch will be merged into the main branch</li>\n<li>the workflow files for Github Actions will be adjusted and made public</li>\n<li>binary packages will be released from the new build/packaging system</li>\n</ul>\n<p>For the more adventurous of you: the \"new-debugger\" branch is already usable and should compile (almost) without problems, but your mileage, as usual, may vary.</p>",
            "author": {
                "name": "Marco Ridoni"
            },
            "tags": [
            ],
            "date_published": "2022-10-24T13:05:06+02:00",
            "date_modified": "2022-10-24T13:05:06+02:00"
        },
        {
            "id": "https://mridoni.github.io/mid-october-update.html",
            "url": "https://mridoni.github.io/mid-october-update.html",
            "title": "Mid-October update",
            "summary": "I am back and I am continuing to review and modify the build process, a few packaging/build related issues should be solved as soon as the next release is out. Due to work-related constraints I cannot give (for now) a solid timeframe, but I hope to have a pre-release in a couple of weeks, maybe a partial one earlier. The goals are: Release a version that contains the new (\"experimental\") debugger but also ships the&hellip;",
            "content_html": "<p><br>I am back and I am continuing to review and modify the build process, a few packaging/build related issues should be solved as soon as the next release is out. Due to work-related constraints I cannot give (for now) a solid timeframe, but I hope to have a pre-release in a couple of weeks, maybe a partial one earlier.</p>\n<p>The goals are:</p>\n<ul>\n<li>Release a version that contains the new (\"experimental\") debugger but also ships the \"standard\" one, that will be - for a hopefully short time - the version to be still normally used</li>\n<li>Release a packaged version for Windows from the new build system (using GitHub actions)</li>\n<li>Include, where possible/desired, versions of GnuCOBOL built with a standard process (also using GitHub actions)</li>\n<li>Release new Linux packages for different distributions (at least Ubuntu 20.04 + 22, Debian 10 + 11, possibly Fedora 35/36) </li>\n<li>The point above implies using the distribution-provided version of Qt. Since this, on a few distributions, includes Qt 6, the next logical step will be moving the primary target to Qt 6 and leaving Qt 5 - if possible - as a secondary option for older platforms. Obviously this will take some time.<br><br>Sorry for the delays but integrating the new debugger into Gix-IDE is/was a long process that needed a break in the development/release, since too many things changed to perform a clean merge between the two versions and maintaining them separate and up-to-date was simply too much work. After the obstacles above are cleared, development should proceed in a quicker way.<br><br><br></li>\n</ul>",
            "author": {
                "name": "Marco Ridoni"
            },
            "tags": [
            ],
            "date_published": "2022-10-11T10:32:06+02:00",
            "date_modified": "2022-10-11T11:31:56+02:00"
        },
        {
            "id": "https://mridoni.github.io/what-is-coming-for-gix-ide-and-gixsql.html",
            "url": "https://mridoni.github.io/what-is-coming-for-gix-ide-and-gixsql.html",
            "title": "What is coming for Gix-IDE and GixSQL",
            "summary": "I am taking a brief pause (i.e. vacation) in the next couple of weeks but I didn't want to leave before giving a few notes about the next steps. See you soon.",
            "content_html": "<p>I am taking a brief pause (i.e. vacation) in the next couple of weeks but I didn't want to leave before giving a few notes about the next steps.</p>\n<ul>\n<li>The new debugger for Gix-IDE is at the point where it can be integrated into the main branch. The next version will have the possibility to choose between the current (named \"standard\") debugger and the \"experimental\" one. At first I thought of shipping the two versions in parallel for some time, but this proved unfeasible: too many things changed between the two versions of Gix-IDE and keeping them in sync - for stuff that is not debugger-related - is simply too much work. Of course this \"fusion\" (it's the internal name of the branch I am working on) in turn led to a lot of changes that need to be tested, together with several changes in building and packaging. This means that the \"fusion\" pre-release will have to wait a few weeks, until I am satisfied that the standard debugger keeps working as it should, but from that moment on, adding features and fixing things should be much easier.</li>\n<li>I am switching the building and packaging process for binary packages to GitHub Actions. It will also take some time for the new release pipeline to reach a certain level of stability and to abandon the old process, but this will make releasing new and \"ad interim\" versions easier and quicker, and also more reproducible, especially for Windows builds.</li>\n<li>GixSQL development will advance in two main directions: 1) the \"autocommit\" feature needs to be reviewed and (probably) fixed for all drivers. 2) updatable cursor support needs to be improved (or, in some cases/drivers, implemented). There is also space for making progress in areas like memory usage, logging, automated testing, refactoring, etc. and, of course, for the usual amount of bug-fixing and parser modifications (thanks, as usual, to Simon Sobisch, whose support has been invaluable).</li>\n</ul>\n<p>See you soon.</p>",
            "author": {
                "name": "Marco Ridoni"
            },
            "tags": [
            ],
            "date_published": "2022-09-20T19:50:27+02:00",
            "date_modified": "2022-09-21T09:15:45+02:00"
        }
    ]
}
